// Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

/*
Console.Write("Input a five-digit number: ");
int number = Convert.ToInt32(Console.ReadLine()); 
int num1 = number / 10000 % 10;
int num2 = number / 1000 % 10;
int rev1 = number / 10 % 10;
int rev2 = number % 10;
int nul = number / 10000;
        
if (nul < 1 || nul > 9)
Console.WriteLine($"Number {number} is not a five-digit number");
else if  (num1 == rev2 && num2 == rev1)
Console.WriteLine($"Number {number} is a palindrom");
else
Console.WriteLine($"Number {number} is not a palindrom");
*/